Repository: Treedent/sciteproj
Catalog: po/*.po
Languages: fr, sv_se

source: License
sv_se: Licens

source: SciteProj is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. SciteProj is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with SciteProj. If not, see <http://www.gnu.org/licenses/>.
fr: SciteProj est un logiciel gratuit: vous pouvez le redistribuer et / ou le modifier selon les termes de la Licence Publique Générale GNU publiée par Free Software Foundation, soit la version 3 de la Licence, soit (à votre choix) toute version ultérieure. SciteProj est distribué dans l'espoir qu'il sera utile, mais SANS AUCUNE GARANTIE; Sans même la garantie implicite de QUALITÉ MARCHANDE ou d'APTITUDE À UN USAGE PARTICULIER. Voir la licence publique générale GNU pour plus de détails. Vous devriez avoir reçu une copie de la Licence Publique Générale GNU avec SciteProj. Dans le cas contraire, voir <http://www.gnu.org/licenses/>.
sv_se: SciteProj är fri mjukvara: du kan redistribuera det och/eller modifieradet enligt villkoren i GNU General Public License som publicerad avthe Free Software Foundation; enligt version 3, eller (efter ditt eget val) någon senare version. SciteProj distribueras med förhoppningen att det kommer att vara användbart, men UTAN NÅGON SOM HELST GARANTI; utan ens den implicita garantin av SÄLJBARHET eller ÄNDAMÅLSENLIGHET FÖR NÅGOT SÄRSKILT SYFTE. Se GNU General Public License för fler detaljer. Du bör ha fått en kopia av GNU General Public License tillsammans med detta program; om inte, se <http://www.gnu.org/licenses/>.

source: SciteProj is based on ScitePM by Roy Wood <roy.wood@gmail.com> and Martin Andrews <ScitePM@PLATFORMedia.com> Many thanks to Mattias Wecksten <wecksten@gmail.com> Frank Wunderlich For more information about SciteProj, see the README file that is provided with the package.
sv_se: Sciteproj är baserat på ScitePM av Roy Wood <roy.wood@gmail.com> och Martin Andrews <ScitePM@PLATFORMedia.com> Många tack till Mattias Wecksten <wecksten@gmail.com> Frank Wunderlich För mer information om SciteProj, se README-filen som följer med detta paket.

source: %s: Could not add drag/drop data: %s
sv_se: %s: Kunde inte addera draosläpp-data: %s

source: %s: Could not format drag/drop data: %s
sv_se: %s: Kunde inte formatera draosläpp-data: %s

source: %s: Could not set drag/drop data
sv_se: %s: Kunde inte sätta draosläpp-data

source: %s: Cannot drop a group node into itself
sv_se: %s: Kan inte släppa en grupp i sig själv

source: Error: Invalid directory!
sv_se: Fel: Ogiltig katalog!

source: Error: Couldn't g_chdir to directory
sv_se: Fel: Kunde inte g_chdir till katalog

source: Couldn't create file with the name %s!
sv_se: Kunde inte skapa en fil med namnet '%s'!

source: _File
fr: _Fichier
sv_se: Arkiv

source: _Edit
fr: _Editer
sv_se: R_edigera

source: _View
fr: _Voir
sv_se: _Visa

source: _Help
fr: _Aide
sv_se: _Hjälp

source: _Open Project
sv_se: Öppna projekt

source: Open Project
sv_se: Öppna projekt

source: _Save Project
sv_se: _Spara projekt

source: Save Project
sv_se: Spara projekt

source: Save Project As...
sv_se: Spara projekt som...

source: Save Project with a specific filename
sv_se: Spara projekt med ett specifikt filnamn

source: _Exit
sv_se: _Avsluta

source: Exit
sv_se: Avsluta

source: Create _Group
sv_se: Skapa _grupp

source: Create a group node in the project
sv_se: Skapar en grupp-nod i projektet

source: Add _File
sv_se: Lägg till _fil

source: Add a file to the project
sv_se: Lägg till en fil i projektet

source: Remove File(s)
sv_se: Ta bort filer

source: Remove selected files from the project
sv_se: Ta bort valda filer från projektet

source: Expand All Groups
sv_se: Expandera alla grupper

source: Collapse All Groups
sv_se: Kollapsa alla grupper

source: Search
sv_se: Sök

source: Search for a string in the project
sv_se: Sök efter en sträng i projektet

source: _About
sv_se: _Om

source: Show information about this application
sv_se: Visa information om denna applikation

source: Add Files
sv_se: Lägg till filer

source: Add files to the project
sv_se: Lägg till filer till projektet

source: Add Group
sv_se: Lägg till grupp

source: Add a group to the project
sv_se: Lägg till en grupp till projektet

source: Add Files to Group
sv_se: Lägg till filer till grupp

source: Add files to an existing group
sv_se: Lägg till filer till en existerande grupp

source: Add Subgroup to Group
sv_se: Lägg till undergrupp till grupp

source: Add a subgroup to an existing group
sv_se: Lägger till en undergrupp till en existerande grupp

source: Rename Group
sv_se: Byt namn på grupp

source: Rename a group
sv_se: Byter namn på en grupp

source: Remove Group From Project
sv_se: Ta bort grupp från projektet

source: Remove a group and its children from the project
sv_se: Ta bort en grupp och dess innehåll från projektet

source: Sort Group Ascending
sv_se: Sortera grupp stigande

source: Sort the filenames ascending
sv_se: Sorterar filnamnen i gruppen stigande

source: Sort Group Descending
sv_se: Sortera grupp fallande

source: Sort the filenames descending
sv_se: Sorterar filnamnen i gruppen fallande

source: Group Properties
fr: Grouper les propriétés
sv_se: Mappegenskaper

source: Show group properties
sv_se: Visa mappegenskaper

source: Edit Options
sv_se: Editera egenskaper

source: Edit Program Options
sv_se: Editera programmets egenskaper

source: View Recently Opened Files
sv_se: Visa nyligen öppnade filer

source: View Recent Files
sv_se: Visa senaste filer

source: Open File in SciTE
sv_se: Öppna fil i SciTE

source: Open a file in SciTE
sv_se: Öppnar en fil i SciTE

source: Remove File From Project
sv_se: Ta bort fil från projektet

source: Remove a file from the project
sv_se: Ta bort en fil från projektet

source: Copy Filename to Clipboard
sv_se: Kopiera filnamn till urklipp

source: Copies the full path and filename to the clipboard
sv_se: Kopierar filnamn inklusive hela sökvägen till urklipp

source: File Properties
fr: Propriétés du fichier
sv_se: Filegenskaper

source: Show file properties
sv_se: Visa fileegenskaper

source: Remove File from this List
sv_se: Ta bort fil från denna lista

source: Remove file from this List
sv_se: Ta bort fil från denna lista

source: Copy filename to clipboard
fr: Copier le fichier dans le presse-papier
sv_se: Kopiera filnamn till urklipp

source: %s: Could not create main window, gtk_window_new() = NULL
sv_se: %s: Kunde inte skapa huvudfönstret (main), gtk_window_new() = NULL

source: %s: Could not create GtkActionGroup, gtk_action_group_new() = NULL
sv_se: %s: Kunde inte skapa GtkActionGroup, gtk_action_group_new() = NULL

source: %s: Could not create GtkUIManager, gtk_ui_manager_new() = NULL
sv_se: %s: Kunde inte skapa GtkUIManager, gtk_ui_manager_new() = NULL

source: %s: Could not create create menus from XML, gtk_ui_manager_add_ui_from_string() = %s
sv_se: %s: Kunde inte skapa menyer från XML, gtk_ui_manager_add_ui_from_string() = %s

source: %s: Could not create main scrolled window, gtk_scrolled_window_new() = NULL
sv_se: %s: Kunde inte skapa main scrolled window, gtk_scrolled_window_new() = NULL

source: %s: Could not create the treestore
sv_se: %s: Kunde inte skapa treestore

source: %s: Could not create GtkTreeView, gtk_tree_view_new_with_model() = NULL
sv_se: %s: Kunde inte skapa GtkTreeView, gtk_tree_view_new_with_model() = NULL

source: %s: Could not create GtkCellRenderer, gtk_cell_renderer_text_new() = NULL
sv_se: %s: Kunde inte skapa GtkCellRenderer, gtk_cell_renderer_text_new() = NULL

source: %s: Could not create GtkCellRenderer, gtk_cell_renderer_pixbuf_new() = NULL
sv_se: %s: Kunde inte skapa GtkCellRenderer, gtk_cell_renderer_pixbuf_new() =NULL

source: %s: Could not create GtkTreeViewColumn, gtk_tree_view_column_new() = NULL
sv_se: %s: Kunde inte skapa GtkTreeViewColumn, gtk_tree_view_column_new() = NULL

source: %s: Could not create recentGrid, gtk_grid_new() = NULL
sv_se: %s: Kunde inte skapa recentGrid, gtk_grid_new() = NULL

source: %s: Could not create recentGrid, gtk_vbox_new() = NULL
sv_se: %s: Kunde inte skapa recentGrid, gtk_vbox_new() = NULL

source: %s: Could not create main vbox, gtk_hbox_new() = NULL
sv_se: %s: Kunde inte skapa main vbox, gtk_hbox_new() = NULL

source: %s: Could not create fullVbox, gtk_hbox_new() = NULL
sv_se: %s: Kunde inte skapa fullVbox, gtk_hbox_new() = NULL

source: %s: Could not create statusBarVbox, gtk_hbox_new() = NULL
sv_se: %s: Kunde inte skapa statusBarVbox, gtk_hbox_new() = NULL

source: %s: Could not init statusbar
sv_se: %s: Kunde inte initiera statusfältet

source: %s: Error formatting Scite director command, g_strdup_printf() = NULL
sv_se: %s: Fel när formatterade Scite director-kommando, g_strdup_printf() = NULL

source: Opened %s
fr: Ouvert %s
sv_se: Öppnade %s

source: Could not open selected file: %s
fr: Impossible d'ouvrir le fichier : %s
sv_se: Kunde inte öppna vald fil: %s

source: Error initing preferences: %s
sv_se: Fel vid initiering av inställningar: %s

source: Environment variable exists, but doesn't point to a folder containing scite.
fr: La variable d'environnement existe, mais ne pointe pas vers un dossier contenant SciTE.
sv_se: Miljövariabeln finns, men hänvisar inte till någon mapp som innehåller scite.

source: Couldn't find a SciTE executable named '%s'!
fr: Impossible de trouver un exécutable de SciTE nommé '%s'!
sv_se: Kunde inte hitta en körbar fil med namnet '%s'!

source: Checking for SciTE in the standard locations instead.
fr: Vérification de SciTE plutôt à son emplacements standard.
sv_se: Kollar efter SciTE på standard-platserna istället.

source: Warning! Couldn't locate SciTE! Program will start, but you won't be able to open SciTE to edit files.
fr: Attention! Impossible de localiser SciTE! Le programme démarrera, mais vous ne pourrez pas ouvrir SciTE pour éditer des fichiers.
sv_se: Varning! Kunde inte hitta SciTE! Programmet kommer att starta, men du kommer inte kunna använda SciTE för att editera filer.

source: Could not initialize application globals: %s
sv_se: Kunde inte initiera program-globaler: %s

source: Usage: %s [OPTION] [FILE]...
sv_se: Användning: %s [FLAGGOR] [FIL]...

source: Options can be one of the following:
sv_se: Flaggor kan vara en av följande:

source: --help display this help and exit
sv_se: --help visa denna hjälp och avsluta

source: --version show version of sciteproj and exit
sv_se: --version visa version av sciteproj och avsluta

source: --scite FILENAME set a filename for the instance of SciTE to open
sv_se: --scite FILNAMN sätt ett filnamn för instansen av SciTE du önskar köra

source: --generate FILENAME [MAX_DEPTH] generate a sciteproj project file with name FILENAME, recursively from current folder contents, at most MAX_DEPTH folders down in the hierarchy
sv_se: --generate FILNAMN [MAX_DJUP] generera en sciteproj-projektfil med namn FILNAMN, rekursivt från aktuell folderinnehåll, med som mest MAX_DJUP steg ner i mapp-hierarkin

source: The syntax for that command is:
sv_se: Syntaxen för det kommandot är:

source: sciteproj --generate FILENAME [MAX_DEPTH]
sv_se: sciteproj --generate FILNAMN [MAX_DJUP]

source: Expected an integer as max_depth...
sv_se: Väntade ett heltal för MAX_DJUP...

source: Generated '%s' successfully!
sv_se: Genererade '%s' framgångsrikt!

source: Group name:
fr: Nom de groupe :
sv_se: Gruppnamn:

source: Contains number of Files:
sv_se: Innehåller antal filer:

source: Filename:
fr: Nom de fichier :
sv_se: Filnamn:

source: Path:
fr: Chemin :
sv_se: Sökväg:

source: File size:
fr: Taille de fichier :
sv_se: Filstorlek:

source: %s: Could not create GtkTreeStore, gtk_tree_store_new() = NULL
sv_se: %s: Kunde inte skapa GtkTreeStore, gtk_tree_store_new() = NULL

source: %s: Could not create recent scrolled window, gtk_scrolled_window_new() = NULL
sv_se: %s: Kunde inte skapa scrolled_window för nyligen öppnade filer, gtk_scrolled_window_new() = NULL

source: %s: Could not create the recent treestore
sv_se: %s: Kunde inte skapa treestore för nyligen öppnade filer

source: Recently opened files:
fr: Fichier ouverts récemment :
sv_se: Nyligen öppnade filer:

source: Error!!!
fr: Erreur !!!
sv_se: Fel!!!

source: %s: Error calling g_io_channel_read_chars() = %s
sv_se: %s: Fel när anropade g_io_channel_read_chars() = %s

source: Closed %s
fr: Fermé %s
sv_se: Stängde %s

source: Closed SciTE
fr: SciTE fermé
sv_se: Stängde SciTE

source: Switched to %s
fr: Basculer vers %s
sv_se: Växlade till %s

source: %s: condition = G_IO_ERR
sv_se: %s: kondition = G_IO_ERR

source: %s: condition = G_IO_HUP
sv_se: %s: kondition = G_IO_HUP

source: %s: Could not launch Scite, setenv("%s", "%s") failed, errno = %d = %s
sv_se: %s: Kunde inte starta Scite, setenv("%s", "%s") misslyckades, errno = %d = %s

source: %s: Could not launch Scite, remove("%s") failed, errno = %d = %s
sv_se: %s: Kunde inte starta Scite, remove("%s") misslyckades, errno = %d = %s

source: %s: Could not launch Scite, mkfifo("%s") failed, errno = %d = %s
sv_se: %s: Kunde inte starta Scite, mkfifo("%s") misslyckades, errno = %d = %s

source: %s: Could not launch Scite, open("%s") failed, errno = %d = %s
sv_se: %s: Kunde inte starta Scite, open("%s") misslyckades, errno = %d = %s

source: %s: Could not launch Scite, g_io_channel_unix_new("%s") failed, errno = %d = %s
sv_se: %s: Kunde inte starta Scite, g_io_channel_unix_new("%s") misslyckades, errno = %d= %s

source: %s: Could not launch Scite, g_io_channel_set_encoding( ) failed, error = %s
sv_se: %s: Kunde inte starta Scite, g_io_channel_set_encoding() misslyckades, errno = %s

source: %s: Could not launch Scite, pipe( ) failed, errno = %d = %s
sv_se: %s: Kunde inte starta Scite, pipe() misslyckades, errno = %d = %s

source: %s: Could not launch Scite, fork() failed, errno = %d = %s
sv_se: %s: Kunde inte starta Scite, fork() misslyckades, errno = %d = %s

source: Error: Could not execute Scite from child process
sv_se: Fel: Kunde inte exekvera Scite från barnprocessen

source: %s: Problem sending message to parent: messageLength = %d, bytesWritten = %d
sv_se: %s: Problem att skicka meddelande till förälder: messageLength = %d, bytesWritten = %d

source: %s: Could not launch Scite, execlp( ) failed
sv_se: %s: Kunde inte starta Scite, execlp( ) misslyckades

source: Connecting to Scite....
fr: Connexion à SciTE...
sv_se: Ansluter till Scite....

source: %s: Could not connect to Scite
sv_se: %s: Kunde inte ansluta till SciTE

source: Launched SciTE
fr: SciTE chargé
sv_se: Startade SciTE

source: %s: Could not send command to Scite, write("%s") failed, errno = %d = %s
sv_se: %s: Kunde inte skicka kommando till Scite, write("%s") misslyckades, errno = %d = %s

source: %s: Could not open X display, XOpenDisplay() = NULL
sv_se: %s: Kunde inte öppna X-displayen, XOpenDisplay() = NULL

source: %s: Could not activate SciTE window, X11 window ID invalid
sv_se: %s: Kunde inte aktivera SciTEs fönster, dess X11 fönster-ID är ogiltigt

source: %s: Could not activate SciTE, XSendEvent() = FALSE
sv_se: %s: Kunde inte aktivera SciTE, XSendEvent() =FALSE

source: Search project
sv_se: Sök i projektet

source: Find What:
sv_se: Hitta vad:

source: Match case
sv_se: Matcha stora/små bokstäver

source: Match whole word only
sv_se: Matcha endast hela ord

source: There was problems opening the following files in the project:
sv_se: Det var problem med att öppna följande filer i projektet:

source: They couldn't be opened for reading in the search.
sv_se: Dom kunde inte öppnas för läsning i sökningen.

source: Please enter a text to search for!
sv_se: Vänligen mata in en text att söka efter!

source: Error:%s
sv_se: Fel:%s

source: Filename
sv_se: Filnamn

source: Line
sv_se: Rad

source: File contents
sv_se: Fil-innehåll

source: Found %d elements
sv_se: Hittade %d element

source: The search didn't give any results.
sv_se: Sökningen gav inga resultat.

source: Welcome to SciteProj
fr: Bienvenue dans SciteProj
sv_se: Välkommen till SciteProj

source: %s: Specified path, '%s', is not absolute
sv_se: %s: Specificerad sökväg, '%s' är inte absolut

source: %s: Could not determine current working directory, getcwd() = NULL, errno = %d
sv_se: %s: Kunde inte avgöra nuvarande arbetssökväg, getcwd() = NULL, errnmo = %d

source: %s: Specified path, '%s', is absolute
sv_se: %s: Specificerad sökväg, '%s' är absolut

source: %s: Could not allocate memory, g_try_realloc(%ld) = NULL
sv_se: %s: Kunde inte allokera minne, g_try_realloc(%ld) = NULL

source: An error occurred while making project file paths relative: %s
sv_se: Ett fel uppstod medans projektets sökvägar gjordes relativa: %s

source: Load Project
sv_se: Ladda Projekt

source: Project Files (*.xml)
sv_se: Projektfiler (*.xml)

source: All Files
sv_se: Alla filer

source: C/C++ Files
sv_se: C/C++-filer

source: LAMP Script Files
sv_se: LAMP-skript-filer

source: Java* Files
sv_se: Java*-filer

source: HTML Files
sv_se: HTML-filer

source: You need to save the project before adding files.
sv_se: Du måste spara projektet innan du adderar filer.

source: The following files:
sv_se: Följande filer:

source: %s couldn't be added, because they were already present in the project.
sv_se: %s kunde inte läggas till, eftersom dom redan fanns i projektet.

source: %s: Not a valid sciteproj XML file!
sv_se: %s: Är inte en giltig sciteproj XML-fil!

source: SciteProj is based on ScitePM by
fr: SciteProj est basé sur ScitePM par

source: Many thanks to
fr: Un grand merci à

source: For more information about SciteProj, see the README file that is provided with this package.
fr: Pour plus d'informations sur SciteProj, consultez le fichier README qui est fourni avec ce paquet.

source: [UNTITLED]
fr: [SANS_TITRE]

source: Show program version and quit
fr: Montrer la version du programme et quitter

source: Set a filename for the instance of SciTE to open
fr: Définir un nom de fichier pour l'instance de SciTE à ouvrir

source: Load a folder
fr: Charger un dossier

source: Start SciTE automatically with SciteProj
fr: Démarrer SciTE automatiquement avec SciteProj

source: SciTE Project Manager
fr: SciTE Gestionnaire de projet

source: option parsing failed: %s
fr: L'analyse des options a échoué : %s

source: A folder is expected as parameter to sciteproj...
fr: Un dossier est attendu comme paramètre pour Sciteproj...

source: Could not setup the gui: %s
fr: Impossible de configurer l'interface : %s

source: Not a valid folder!
fr: Dossier non valide !

source: _Quit
fr: _Quitter

source: Edit properties
fr: Éditer les propriétés

source: Show Recent Files
fr: Montrer les fichiers récents

source: About
fr: A Propos

source: Open file in SciTE
fr: Ouvrir le fichier avec SciTE

source: Properties
fr: Propriétés

source: Sort folder contents
fr: Classer le contenu du dossier

source: Sort ascending by name
fr: Classement croissant par nom

source: Sort descending by name
fr: Classement décroissant par nom

source: Sort ascending by extension
fr: Classement croissant par extension

source: Sort descending by extension
fr: Classement décroissant par extension

source: Update folder content
fr: Mettre à jour le contenu du dossier

source: Remove file from this list
fr: Enlever le fichier de la liste

source: Full folder:
fr: Dossier complet :

source: Delete all selected items?
fr: Supprimer tous les éléments sélectionnés ?

source: Delete file '%s'?
fr: Supprimer le fichier '%s' ?

source: Delete file?
fr: Supprimer le fichier ?

source: Delete folder '%s' and any contained files?
fr: Supprimer le dossier '%s' et tous ses fichiers contenus ?

source: Delete folder and any contained files?
fr: Supprimer le dossier et tous ses fichiers contenus ?

source: Could not delete the selected node: %s
fr: Impossible de supprimer le nœud sélectionné: %s

source: Error: %s
fr: Erreur : %s
